Использование GitHub
====================

Аккаунт и репозитории на github.com
-----------------------------------

В первую очередь необходимо установить клиент git, указанный в списке требуемого ПО.


Затем надо зарегистрироваться на https://github.com/. После чего можно будет создавать свои репозитории или присоединиться к работе над проектами коллег, сделав fork другого репозитория. Вам предлагается начать с создания fork-а к заведенному мной репозиторию <тут будет адрес>, где я буду выкладывать примеры кода к занятиям и задания. О механизме обмена кодом между пользователями мы поговорим на следующем занятии.

Выполнение домашних заданий
---------------------------

Домашние задания выполняются на платформе GitHub Classrooms. При выполнении ДЗ будет необходимо выполнить следующие шаги:

0. Получить от меня очередную ссылку на задание
0. Пройти по этой ссылке и выбрать "Accept assignment". После чего система автоматически создаст для вас новый персональный репозиторий, и выдаст его адрес.
0. Склонировать репозиторий в клиенте Git
0. Ознакомиться с общим текстом задания и вашим персональным вариантом
0. Выполнить задание и запушить изменения на сервер
0. Дождаться выполнения автоматической проверки через TravisCI
0. Создать "New issue" с текстом "Задание выполнено" и назначить меня ответственным